vlm/extension/Documents/ПроизводственнаяОперация2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПроизводственнаяОперация2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Этап</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТехнологическиеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

vlm/extension/Enums/ЕдиницыИзмеренияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЕдиницыИзмеренияВремени</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Час</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Сутки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Секунда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Минута</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>День</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

vlm/extension/Documents/ПроизводственнаяОперация2_2/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура бит_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	Если НЕ ЭтотОбъект.Проведен 
		И РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		//4.1
		//Если документ "Производственная операция" не был проведен, 
		///происходит проведение и при этом заполнены реквизиты 
			//"(бит)Время выполнения план", 
			//"(бит)Время выполнения план ед. изм", 
			//"(бит)Количество план", "(бит)Количество план ед. изм.", 
		//то необходимо провести "виртуальный" расчет и сравнить результат с записанными значениями реквизитов.	
		Если ЗначениеЗаполнено(ЭтотОбъект.бит_КоличествоПлан) 
			И ЗначениеЗаполнено(ЭтотОбъект.бит_ВремяВыполненияПлан) Тогда
			
			ЕстьРазличияПриРасчете = Ложь;
			
			Результат = ПолучитьКоличествоВыходногоИзделия();
			Если Результат.Количество <> ЭтотОбъект.бит_КоличествоПлан 
				ИЛИ Результат.ЕдиницаИзмерения <> ЭтотОбъект.бит_КоличествоПланЕдИзм 
				ИЛИ ЭтотОбъект.бит_ВремяВыполненияПлан <> ЭтотОбъект.ВремяВыполнения
				ИЛИ ЭтотОбъект.бит_ВремяВыполненияПланЕдИзм <> ЭтотОбъект.ВремяВыполненияЕдИзм Тогда
				ЕстьРазличияПриРасчете = Истина;
			КонецЕсли;                       
			
			Если ЕстьРазличияПриРасчете Тогда
				Сообщить("Данные реквизитов ""Время выполнения план" "Количество план"" отличаются от данных по готовой продукции на вкладке ""Выходная продукция"" и трудозатрат на вкладке ""Трудовые затраты"". Необходима корректировка плановых данных или удаление текущего и создание нового документа ""Производственная операция"" для формирования корректных данных");
			КонецЕсли;
			
		//Если документ "Производственная операция" не был проведен, 
		//происходит проведение или это новый документ и проводится в первый раз 
		//и не были заполнены реквизиты "(бит)Время выполнения план"
			//, "(бит)Время выполнения план ед. изм", 
			//"(бит)Количество план", 
			//"(бит)Количество план ед. изм., то:			
		ИначеЕсли НЕ ЗначениеЗаполнено(ЭтотОбъект.бит_КоличествоПлан) 
			ИЛИ НЕ ЗначениеЗаполнено(ЭтотОбъект.бит_ВремяВыполненияПлан) Тогда
			                                                                          
			Результат = ПолучитьКоличествоВыходногоИзделия();
			
			ЭтотОбъект.бит_КоличествоПлан = Результат.Количество;
			ЭтотОбъект.бит_КоличествоПланЕдИзм = Результат.ЕдиницаИзмерения;
			
			ЭтотОбъект.бит_ВремяВыполненияПлан = ЭтотОбъект.ВремяВыполнения;
			ЭтотОбъект.бит_ВремяВыполненияПланЕдИзм = ЭтотОбъект.ВремяВыполненияЕдИзм;
			
		КонецЕсли;
		
		
	КонецЕсли; 
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
		
КонецПроцедуры 

Функция ПолучитьКоличествоВыходногоИзделия()
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +
	
	Результат = Новый Структура;
	Результат.Вставить("Количество", 0);
	Результат.Вставить("ЕдиницаИзмерения", Справочники.УпаковкиЕдиницыИзмерения.ПустаяСсылка());
	
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("ВидНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ВидыНоменклатуры"));
	ТЗ.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	ТЗ.Колонки.Добавить("ЕдиницаИзмерения", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	
	Для Каждого СтрокаТЗ Из ЭтотОбъект.ВыходныеИзделия Цикл
		
		НоваяСтрокаТЗ = ТЗ.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЗ, СтрокаТЗ);
		
		НоваяСтрокаТЗ.ВидНоменклатуры = СтрокаТЗ.Номенклатура.ВидНоменклатуры;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.Упаковка) Тогда
			НоваяСтрокаТЗ.ЕдиницаИзмерения = СтрокаТЗ.Упаковка; 
		Иначе                                                  
			НоваяСтрокаТЗ.ЕдиницаИзмерения = СтрокаТЗ.Номенклатура.ЕдиницаИзмерения;
		КонецЕсли;
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ТЗ.Количество КАК Количество,
		|	ТЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ вт_ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(вт_ТЗ.Количество) КАК Количество,
		|	вт_ТЗ.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	вт_ТЗ КАК вт_ТЗ
		|ГДЕ
		|	вт_ТЗ.ВидНоменклатуры В(&ВидНоменклатуры)
		|
		|СГРУППИРОВАТЬ ПО
		|	вт_ТЗ.ЕдиницаИзмерения";
	
	ВидНоменклатуры = Справочники.бит_ЗначенияПоУмолчанию.ПолучитьМассивЗначений(Справочники.бит_ЗначенияПоУмолчанию.ВидыНоменклатурыГотовойПродукцииВПроизводственнойОперации, ЭтотОбъект);
	
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидНоменклатуры);
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Количество = ВыборкаДетальныеЗаписи.Количество;
		Результат.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
	КонецЦикла;
	
	Возврат Результат;
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецФункции

&После("ОбработкаПроведения")
Процедура бит_ОбработкаПроведения(Отказ, РежимПроведения)
	
	// {{ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] +        
	
	ВремяВыполненияПлан = ЭтотОбъект.бит_ВремяВыполненияПлан;
	
	Если ЭтотОбъект.бит_ВремяВыполненияПланЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Секунда Тогда
		ВремяВыполненияПлан = ВремяВыполненияПлан / 3600;
	ИначеЕсли ЭтотОбъект.бит_ВремяВыполненияПланЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
		ВремяВыполненияПлан = ВремяВыполненияПлан / 60;
	ИначеЕсли ЭтотОбъект.бит_ВремяВыполненияПланЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
		ВремяВыполненияПлан = ВремяВыполненияПлан * 24;
	КонецЕсли;
	
	ВремяВыполненияФакт = ЭтотОбъект.ВремяВыполнения;
	Если ЭтотОбъект.ВремяВыполненияЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Секунда Тогда
		ВремяВыполненияФакт = ВремяВыполненияФакт / 3600;	
	ИначеЕсли ЭтотОбъект.ВремяВыполненияЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.Минута Тогда
		ВремяВыполненияФакт = ВремяВыполненияФакт / 60;
	ИначеЕсли ЭтотОбъект.ВремяВыполненияЕдИзм = Перечисления.ЕдиницыИзмеренияВремени.День Тогда
		ВремяВыполненияФакт = ВремяВыполненияФакт * 24;
	КонецЕсли;	
	
	НаборЗаписей = РегистрыСведений.бит_ПремиальныеПоказателиОперацийДляРасчетаЗаработнойПлаты.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Регистратор.Установить(ЭтотОбъект.Ссылка);
	
	НоваяЗапись = НаборЗаписей.Добавить();
	
	НоваяЗапись.Регистратор = ЭтотОбъект.Ссылка;
	НоваяЗапись.Период = ЭтотОбъект.Дата;
	
	НоваяЗапись.Операция = ЭтотОбъект.Операция;
	
	НоваяЗапись.ВремяВыполненияПлан = ВремяВыполненияПлан;
	НоваяЗапись.ВремяВыполненияФакт = ВремяВыполненияФакт;
	
	НоваяЗапись.КоличествоПлан = ЭтотОбъект.бит_КоличествоПлан;
	Результат = ПолучитьКоличествоВыходногоИзделия();
	НоваяЗапись.КоличествоФакт = Результат.Количество;
	НоваяЗапись.ВыполнениеПоВыпуску = ЭтотОбъект.бит_ВыполнениеПоВыпускуПроцент;
	НоваяЗапись.ПричинаЗаниженияНормыВыпуска = ЭтотОбъект.бит_ПричинаЗаниженияНормыВыпуска;
	НоваяЗапись.Выполнено100ПроцентовВыпуска = ЭтотОбъект.бит_Выполнено100ПроцентовВыпуска;
	НоваяЗапись.ВыполнениеПоВремени = ЭтотОбъект.бит_ВыполнениеПоВремениПроцент;
	НоваяЗапись.ПричинаЗаниженияНормыВремени = ЭтотОбъект.бит_ПричинаЗаниженияНормыВремени;
	НоваяЗапись.Выполнено100ПроцентовВремени = ЭтотОбъект.бит_Выполнено100ПроцентовВремени;
	НоваяЗапись.ДополнительноеОборудование = ЭтотОбъект.бит_ДополнительноеОборудование;
	НоваяЗапись.Сверхурочное = ЭтотОбъект.бит_Сверхурочное;
	
	НоваяЗапись.СменноеЗадание = ЭтотОбъект.СменноеЗадание;
	НоваяЗапись.ДатаСменногоЗадания = ЭтотОбъект.СменноеЗадание.Дата;
	
	Если ЗначениеЗаполнено(ЭтотОбъект.Операция)
		И ЗначениеЗаполнено(ЭтотОбъект.Операция.Владелец)
		И ЗначениеЗаполнено(ЭтотОбъект.Операция.Владелец.Владелец) Тогда
		
		НоваяЗапись.НоменклатураВыпуска = ЭтотОбъект.Операция.Владелец.Владелец.ОсновноеИзделиеНоменклатура;
		
	КонецЕсли;
	НоваяЗапись.ВидРабочегоЦентра = ЭтотОбъект.ВидРабочегоЦентра;
	
	          
	НаборЗаписей.Записать();
	
	// }}ПервыйБИТ ЛистТребований [ЛТ5.11] [ASHolyavko@1cbit.ru] [19.08.2025] -
	
КонецПроцедуры
